In [1]:
import pandas as pd
import numpy as np

In [2]:
sozluk1={"isim":["ahmet","mehmet","zeynep","atıl"],
         "spor" :["koşu","yüzme","koşu","basketbol"],
        "kalori":[100,200,300,400]
        }

In [3]:
dataFrame1=pd.DataFrame(sozluk1,index=[0,1,2,3])

In [4]:
dataFrame1

     isim       spor  kalori
0   ahmet       koşu     100
1  mehmet      yüzme     200
2  zeynep       koşu     300
3    atıl  basketbol     400

In [7]:
sozluk2={"isim":["osman","levent","atlas","fatma"],
         "spor" :["koşu","yüzme","koşu","basketbol"],
        "kalori":[200,100,50,300]
        }

In [9]:
dataFrame2=pd.DataFrame(sozluk2,index=[4,5,6,7])

In [10]:
sozluk3={"isim":["atşe","mahmut","duygu","nur"],
         "spor" :["koşu","yüzme","badminton","tenis"],
        "kalori":[300,400,500,250]
        }

In [11]:
dataFrame3=pd.DataFrame(sozluk3,index=[8,9,10,11])

In [12]:
dataFrame2

     isim       spor  kalori
4   osman       koşu     200
5  levent      yüzme     100
6   atlas       koşu      50
7   fatma  basketbol     300

In [13]:
dataFrame3

      isim       spor  kalori
8     atşe       koşu     300
9   mahmut      yüzme     400
10   duygu  badminton     500
11     nur      tenis     250

# concatination

In [16]:
pd.concat([dataFrame1,dataFrame2,dataFrame3],axis=0)

      isim       spor  kalori
4    osman       koşu     200
5   levent      yüzme     100
6    atlas       koşu      50
7    fatma  basketbol     300
4    osman       koşu     200
5   levent      yüzme     100
6    atlas       koşu      50
7    fatma  basketbol     300
8     atşe       koşu     300
9   mahmut      yüzme     400
10   duygu  badminton     500
11     nur      tenis     250